var TEST_TO_MARRIED_MALE = [{'A': '我妻子写的爱的短笺让我感觉很好。', 'E': '我喜欢妻子给我的拥抱。',}, {
    'B': '我喜欢和我的妻子单独呆在一起。',
    'D': '当我的妻子帮助我做我的工作时，我感觉到她的爱。',
}, {'C': '从妻子那里收到特别的礼物会让我很开心。', 'B': '我喜欢与妻子一道做长途旅行。',}, {
    'D': '当我的妻子帮着做洗衣服的工作时，我感觉他爱我。',
    'E': '我喜欢我的妻子抚摸我。',
}, {'E': '当我妻子搂着我时，我感受到他的爱。', 'C': '我知道我的妻子爱我，因为她送礼物给我，让我惊喜。',}, {
    'B': '我不管去哪里，都愿意和我的妻子一起去。',
    'E': '我喜欢牵着我妻子的手。',
}, {'C': '我很珍惜妻子送给我的礼物。', 'A': '我喜欢听妻子对我说，他爱我。',}, {
    'E': '我喜欢我的妻子坐在我旁边。',
    'A': '我喜欢听妻子告诉我说，我很帅。',
}, {'B': '能和妻子呆在一起，会令我很高兴。', 'C': '我妻子送给我的即使是最小的礼物，对我来说都很重要。',}, {
    'A': '当妻子告诉我她以我为骄傲的时候，我感觉到她爱我。',
    'D': '当妻子为我饭吃时，我知道她爱我。',
}, {'B': '不管做什么，我都喜欢和妻子一起做这些事。', 'A': '妻子给我的支持意见让我感觉很好。',}, {
    'D': '和妻子对我说的话相比，她为我做的那些小事情对我来说更重要。',
    'E': '我喜欢拥抱我妻子。',
}, {'A': '妻子的赞扬对我来说意义重大。', 'C': '妻子送一些我很喜欢的礼物给我，对我来说很重要。',}, {
    'B': '只有是在我妻子身边，就会让我感觉很好。',
    'E': '我喜欢我的妻子揉我的背部。',
}, {'A': '妻子对我的成就做出的反应让我很受鼓舞。', 'D': '妻子若能帮助做一些她很讨厌做的事情，对我来说意义重大。',}, {
    'E': '我从来没有厌倦过妻子的亲吻。',
    'B': '我喜欢我的妻子对我所做的事情表示出真正的兴趣。',
}, {'D': '我可以指望我的妻子帮助我完成一些任务。', 'C': '当我打开妻子送给我的礼物时，我仍然会感到很兴奋。',}, {
    'A': '我喜欢我的妻子称赞我的外表。。',
    'B': '我喜欢我的妻子聆听我的想法，而且不会急着作出判断或批评。',
}, {'E': '当妻子在我旁边时，我忍不住要触摸他。', 'D': '当我的妻子有时为我跑腿时，我很感谢他。',}, {
    'D': '我的妻子应该为她为了帮助我所做的一切得到奖赏。',
    'C': '有时我会为妻子送给我的礼物是如此用心而感到惊奇。',
}, {'B': '我喜欢妻子给我她全部的注意力。', 'D': '保持家里的清洁是一项很重要的服务行动。',}, {
    'C': '我期待着看到我的妻子会送给我什么生日礼物给我。',
    'A': '我从来没有厌倦过听妻子告诉我，我对她有多么重要。',
}, {'C': '我的妻子通过送礼物给我，让我知道她爱我。', 'D': '我的妻子通过在家里帮助我赶工完成任务，表达了她对我的爱。',}, {
    'B': '在我说话时，我的妻子不会打断我，我喜欢这一点。',
    'C': '我从来没有厌倦过收妻子送给我的礼物。',
}, {'D': '在我累了的时候，我的妻子能够看得出来，而且她善于问我她能帮着做些什么。', 'B': '我们去哪里并不重要，重要的是我只喜欢和我妻子一起去这些地方。',}, {
    'E': '我喜欢和我的妻子作爱。',
    'C': '我喜欢从妻子那里收到礼物，得到惊喜。',
}, {'A': '妻子鼓励的话语给了我信心。', 'B': '我喜欢与我的妻子一起看电影。',}, {
    'C': '我不敢奢求还有哪些礼物比我妻子送给我的礼物更好。',
    'E': '我简直无法把自己的手从妻子身上收回来。',
}, {'D': '对我来说很重要的是，当我太太尽管有其他事情要做，她却来帮助我。', 'A': '当妻子告诉我她很欣赏我的时候，让我感觉非常好。',}, {
    'E': '在我和妻子分开一段时间后，我喜欢拥抱和亲吻他。',
    'A': '我喜欢听到妻子告诉我，她相信我。',
}];

var TEST_TO_MARRIED_FEMALE = [{'A':'我丈夫写的爱的短笺让我感觉很好。','E':'我喜欢丈夫给我的拥抱。',},{'B':'我喜欢和我的丈夫单独呆在一起。','D':'当我的丈夫帮助我洗车时，我感觉到他的爱。',},{'C':'从丈夫那里收到特别的礼物会让我很开心。','B':'我喜欢与丈夫一道做长途旅行。',},{'D':'当我的丈夫帮着做洗衣服的工作时，我感觉他爱我。','E':'我喜欢我的丈夫抚摸我。',},{'E':'当我丈夫搂着我时，我感受到他的爱。','C':'我知道我的丈夫爱我，因为他送礼物给我，让我惊喜。',},{'B':'我不管去哪里，都愿意和我的丈夫一起去。','E':'我喜欢牵着我丈夫的手。',},{'C':'我很珍惜丈夫送给我的礼物。','A':'我喜欢听丈夫对我说，他爱我。',},{'E':'我喜欢我的丈夫坐在我旁边。','A':'我喜欢听丈夫告诉我说，我很漂亮。',},{'B':'能和丈夫呆在一起，会令我很兴奋。','C':'我丈夫送给我的即使是最小的礼物，对我来说都很重要。',},{'A':'当丈夫告诉我他以我为骄傲的时候，我感觉到他爱我。','D':'当丈夫在饭后帮着收拾餐桌时，我知道他爱我。',},{'B':'不管做什么，我都喜欢和丈夫一起做这些事。','A':'丈夫给我的支持意见让我感觉很好。',},{'D':'和丈夫对我说的话相比，他为我做的那些小事情对我来说更重要。','E':'我喜欢拥抱我丈夫。',},{'A':'丈夫的赞扬对我来说意义重大。','C':'丈夫送一些我很喜欢的礼物给我，对我来说很重要。',},{'B':'只有是在我丈夫身边，就会让我感觉很好。','E':'我喜欢我的丈夫帮我推拿。',},{'A':'丈夫对我的成就做出的反应让我很受鼓舞。','D':'丈夫若能帮助做一些他很讨厌做的事情，对我来说意义重大。',},{'E':'我从来没有厌倦过丈夫的亲吻。','B':'我喜欢我的丈夫对我所做的事情表示出真正的兴趣。',},{'D':'我可以指望我的丈夫帮助我完成一些任务。','C':'当我打开丈夫送给我的礼物时，我仍然会感到很兴奋。',},{'A':'我喜欢我的丈夫称赞我的外表。','B':'我喜欢我的丈夫聆听我的想法，而且不会急着作出判断或批评。',},{'E':'当丈夫在我旁边时，我忍不住要触摸他。','D':'当我的丈夫有时为我跑腿时，我很感谢他。',},{'D':'我的丈夫应该为他为了帮助我所做的一切得到奖赏。','C':'有时我会为丈夫送给我的礼物是如此用心而感到惊奇。',},{'B':'我喜欢丈夫给我他全部的注意力。','D':'我喜欢丈夫帮着做家里的清洁。',},{'C':'我期待着看到我的丈夫会送给我什么生日礼物给我。','A':'我从来没有厌倦过听丈夫告诉我，我对他有多么重要。',},{'C':'我的丈夫通过送礼物给我，让我知道他爱我。','D':'我的丈夫不需要我出声就主动帮助我，表达了他对我的爱。',},{'B':'在我说话时，我的丈夫不会打断我，我喜欢这一点。','C':'我从来没有厌倦过收丈夫送给我的礼物。',},{'D':'在我累了的时候，我的丈夫能够看得出来，而且他善于问我他能帮着做些什么。','B':'我们去哪里并不重要，重要的是我只喜欢和我丈夫一起去这些地方。',},{'E':'我喜欢和我的丈夫作爱。','C':'我喜欢从丈夫那里收到礼物，得到惊喜。',},{'A':'丈夫鼓励的话语给了我信心。','B':'我喜欢与我的丈夫一起看电影。',},{'C':'我不敢奢求还有哪些礼物比我丈夫送给我的礼物更好。','E':'我简直无法把自己的手从丈夫身上收回来。',},{'D':'对我来说很重要的是，当我丈夫尽管有其他事情要做，他却来帮助我。','A':'当丈夫告诉我他很欣赏我的时候，让我感觉非常好。',},{'E':'在我和丈夫分开一段时间后，我喜欢拥抱和亲吻他。','A':'我喜欢听到丈夫告诉我，他相信我。',}]

var TEST_DATA